apache/nuttx/arch/arm/src/common/stm32/stm32_pulsecount_m0_v1.c
/****************************************************************************
 * arch/arm/src/common/stm32/stm32_pulsecount_m0_v1.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <inttypes.h>
#include <stdio.h>
#include <assert.h>
#include <errno.h>
#include <nuttx/debug.h>

#include <nuttx/arch.h>
#include <nuttx/timers/pulsecount.h>
#include <arch/board/board.h>

#include "arm_internal.h"
#include "chip.h"
#include "stm32_gpio.h"
#include "stm32_pulsecount.h"
#include "stm32_rcc.h"
#include "stm32_tim.h"

/* This module only supports pulse count on advanced timers. */

#ifdef CONFIG_STM32_TIM1_PULSECOUNT

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Pulse count is supported by advanced timers only. */

#define TIMTYPE_ADVANCED     4  /* Advanced timers:  TIM1 */
#define TIMTYPE_TIM1         TIMTYPE_ADVANCED

#define HAVE_IP_TIMERS_V2    1

/* CCMR2 */

#define HAVE_CCMR2           1

#ifdef STM32_APB2_TIM1_CLKIN
#  define PULSECOUNT_TIM1_CLKIN STM32_APB2_TIM1_CLKIN
#else
#  define PULSECOUNT_TIM1_CLKIN STM32_APB1_TIM1_CLKIN
#endif

#if CONFIG_STM32_TIM1_PULSECOUNT_CHANNEL == 1
#  define PULSECOUNT_TIM1_CHCFG GPIO_TIM1_CH1OUT
#elif CONFIG_STM32_TIM1_PULSECOUNT_CHANNEL == 2
#  define PULSECOUNT_TIM1_CHCFG GPIO_TIM1_CH2OUT
#elif CONFIG_STM32_TIM1_PULSECOUNT_CHANNEL == 3
#  define PULSECOUNT_TIM1_CHCFG GPIO_TIM1_CH3OUT
#elif CONFIG_STM32_TIM1_PULSECOUNT_CHANNEL == 4
#  define PULSECOUNT_TIM1_CHCFG GPIO_TIM1_CH4OUT
#else
#  error Unsupported TIM1 pulse count channel
#endif

/* Debug ********************************************************************/

#ifdef CONFIG_DEBUG_TIMER_INFO
#  define pulsecount_dumpgpio(p,m)
#  warning "pulsecount_dumpgpio not implemented"
#else
#  define pulsecount_dumpgpio(p,m)
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct stm32_pulsecountchan_s
{
  uint8_t channel;
  uint32_t pincfg;
};

/* This structure represents the state of one pulsecount timer */

struct stm32_pulsecounttimer_s
{
  const struct pulsecount_ops_s *ops;
  struct stm32_pulsecountchan_s channel;
  uint8_t timid;
  uint8_t timtype;
  uint8_t irq;
  uint32_t prev;
  uint32_t curr;
  uint32_t count;
  uint32_t base;
  uint32_t pclk;
  void *handle;
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Register access */

static uint32_t stm32pulsecount_getreg(struct stm32_pulsecounttimer_s *priv,
                                       int offset);
static void stm32pulsecount_putreg(struct stm32_pulsecounttimer_s *priv,
                                   int offset, uint32_t value);
static void stm32pulsecount_modifyreg(struct stm32_pulsecounttimer_s *priv,
                                      uint32_t offset, uint32_t clearbits,
                                      uint32_t setbits);

#ifdef CONFIG_DEBUG_TIMER_INFO
static void stm32pulsecount_dumpregs(struct stm32_pulsecounttimer_s *priv,
                              const char *msg);
#else
#  define stm32pulsecount_dumpregs(priv,msg)
#endif

/* Timer management */

static int
stm32pulsecount_output_configure(struct stm32_pulsecounttimer_s *priv,
                                 uint8_t channel);
static int stm32pulsecount_timer(struct stm32_pulsecounttimer_s *priv,
                                 const struct pulsecount_info_s *info);
static void stm32pulsecount_setapbclock(
  struct stm32_pulsecounttimer_s *priv, bool on);
static int stm32pulsecount_interrupt(struct stm32_pulsecounttimer_s *priv);
static int stm32pulsecount_tim1interrupt(int irq, void *context, void *arg);
static uint32_t stm32pulsecount_pulsecount(uint32_t count);

/* Pulsecount driver methods */

static int stm32pulsecount_setup(struct pulsecount_lowerhalf_s *dev);
static int stm32pulsecount_shutdown(struct pulsecount_lowerhalf_s *dev);

static int stm32pulsecount_start(struct pulsecount_lowerhalf_s *dev,
                                 const struct pulsecount_info_s *info,
                                 void *handle);

static int stm32pulsecount_stop(struct pulsecount_lowerhalf_s *dev);
static int stm32pulsecount_ioctl(struct pulsecount_lowerhalf_s *dev,
                          int cmd, unsigned long arg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* This is the list of lower half pulsecount driver methods used by the upper
 * half driver.
 */

static const struct pulsecount_ops_s g_pulsecountops =
{
  .setup       = stm32pulsecount_setup,
  .shutdown    = stm32pulsecount_shutdown,
  .start       = stm32pulsecount_start,
  .stop        = stm32pulsecount_stop,
  .ioctl       = stm32pulsecount_ioctl,
};

#ifdef CONFIG_STM32_TIM1_PULSECOUNT
static struct stm32_pulsecounttimer_s g_pulsecount1dev =
{
  .ops         = &g_pulsecountops,
  .timid       = 1,
  .channel     =
  {
    .channel   = CONFIG_STM32_TIM1_PULSECOUNT_CHANNEL,
    .pincfg    = PULSECOUNT_TIM1_CHCFG,
  },
  .timtype     = TIMTYPE_TIM1,
  .irq         = STM32_IRQ_TIM1_BRK,
  .base        = STM32_TIM1_BASE,
  .pclk        = PULSECOUNT_TIM1_CLKIN,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32pulsecount_reg_is_32bit
 *
 * Description:
 *   Verify whether the timer register is 32bit or not.
 *
 * Input Parameters:
 *   timtype - The type of the timer. See the TIMTYPE_* definitions
 *   offset  - The offset to the register to read
 *
 * Returned Value:
 *   Return true for 32 bits register; false otherwise.
 *
 ****************************************************************************/

static bool stm32pulsecount_reg_is_32bit(uint8_t timtype, uint32_t offset)
{
  if (timtype == TIMTYPE_ADVANCED)
    {
      if (offset == STM32_ATIM_CR2_OFFSET   ||
          offset == STM32_ATIM_CCMR1_OFFSET ||
          offset == STM32_ATIM_CCMR2_OFFSET ||
          offset == STM32_ATIM_CCER_OFFSET  ||
          offset == STM32_ATIM_BDTR_OFFSET  ||
          offset == STM32_ATIM_DMAR_OFFSET  ||
          offset == STM32_ATIM_AF1_OFFSET   ||
          offset == STM32_ATIM_TISEL_OFFSET)
        {
          return true;
        }
    }

