apache/nuttx/arch/arm/src/common/stm32/stm32_pulsecount_m0_v1.c
  return false;
}

/****************************************************************************
 * Name: stm32pulsecount_getreg
 *
 * Description:
 *   Read the value of an pulsecount timer register
 *
 * Input Parameters:
 *   priv   - A reference to the pulsecount timer status
 *   offset - The offset to the register to read
 *
 * Returned Value:
 *   The current contents of the specified register
 *
 ****************************************************************************/

static uint32_t stm32pulsecount_getreg(
  struct stm32_pulsecounttimer_s *priv, int offset)
{
  uint32_t retval;

  if (stm32pulsecount_reg_is_32bit(priv->timtype, offset) == true)
    {
      /* 32-bit register */

      retval = getreg32(priv->base + offset);
    }
  else
    {
      /* 16-bit register */

      retval = getreg16(priv->base + offset);
    }

  /* Return 32-bit value */

  return retval;
}

/****************************************************************************
 * Name: stm32pulsecount_putreg
 *
 * Description:
 *   Read the value of an pulsecount timer register
 *
 * Input Parameters:
 *   priv   - A reference to the pulsecount timer status
 *   offset - The offset to the register to read
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void stm32pulsecount_putreg(struct stm32_pulsecounttimer_s *priv,
                                   int offset, uint32_t value)
{
  if (stm32pulsecount_reg_is_32bit(priv->timtype, offset) == true)
    {
      /* 32-bit register */

      putreg32(value, priv->base + offset);
    }
  else
    {
      /* 16-bit register */

      putreg16((uint16_t)value, priv->base + offset);
    }
}

/****************************************************************************
 * Name: stm32pulsecount_modifyreg
 *
 * Description:
 *   Modify timer register (32-bit or 16-bit)
 *
 * Input Parameters:
 *   priv    - A reference to the pulsecount timer status
 *   offset  - The offset to the register to read
 *   clrbits - The bits to clear
 *   setbits - The bits to set
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void stm32pulsecount_modifyreg(struct stm32_pulsecounttimer_s *priv,
                               uint32_t offset, uint32_t clearbits,
                               uint32_t setbits)
{
  if (stm32pulsecount_reg_is_32bit(priv->timtype, offset) == true)
    {
      /* 32-bit register */

      modifyreg32(priv->base + offset, clearbits, setbits);
    }
  else
    {
      /* 16-bit register */

      modifyreg16(priv->base + offset, clearbits, setbits);
    }
}

/****************************************************************************
 * Name: stm32pulsecount_dumpregs
 *
 * Description:
 *   Dump all timer registers.
 *
 * Input Parameters:
 *   priv - A reference to the pulsecount timer status
 *   msg  - A message to be printed on the screen
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_DEBUG_TIMER_INFO
static void stm32pulsecount_dumpregs(struct stm32_pulsecounttimer_s *priv,
                              const char *msg)
{
  _info("%s:\n", msg);
  _info("  CR1: %04x CR2:  %04x SMCR:  %04x DIER:  %04x\n",
          stm32pulsecount_getreg(priv, STM32_GTIM_CR1_OFFSET),
          stm32pulsecount_getreg(priv, STM32_GTIM_CR2_OFFSET),
          stm32pulsecount_getreg(priv, STM32_GTIM_SMCR_OFFSET),
          stm32pulsecount_getreg(priv, STM32_GTIM_DIER_OFFSET));
  _info("   SR: %04x EGR:  %04x CCMR1: %04x CCMR2: %04x\n",
          stm32pulsecount_getreg(priv, STM32_GTIM_SR_OFFSET),
          stm32pulsecount_getreg(priv, STM32_GTIM_EGR_OFFSET),
          stm32pulsecount_getreg(priv, STM32_GTIM_CCMR1_OFFSET),
          stm32pulsecount_getreg(priv, STM32_GTIM_CCMR2_OFFSET));
  _info(" CCER: %04x CNT:  %04x PSC:   %04x ARR:   %04x\n",
          stm32pulsecount_getreg(priv, STM32_GTIM_CCER_OFFSET),
          stm32pulsecount_getreg(priv, STM32_GTIM_CNT_OFFSET),
          stm32pulsecount_getreg(priv, STM32_GTIM_PSC_OFFSET),
          stm32pulsecount_getreg(priv, STM32_GTIM_ARR_OFFSET));
  _info(" CCR1: %04x CCR2: %04x CCR3:  %04x CCR4:  %04x\n",
          stm32pulsecount_getreg(priv, STM32_GTIM_CCR1_OFFSET),
          stm32pulsecount_getreg(priv, STM32_GTIM_CCR2_OFFSET),
          stm32pulsecount_getreg(priv, STM32_GTIM_CCR3_OFFSET),
          stm32pulsecount_getreg(priv, STM32_GTIM_CCR4_OFFSET));
  if (priv->timtype == TIMTYPE_ADVANCED)
    {
      _info("  RCR: %04x BDTR: %04x DCR:   %04x DMAR:  %04x\n",
          stm32pulsecount_getreg(priv, STM32_ATIM_RCR_OFFSET),
          stm32pulsecount_getreg(priv, STM32_ATIM_BDTR_OFFSET),
          stm32pulsecount_getreg(priv, STM32_ATIM_DCR_OFFSET),
          stm32pulsecount_getreg(priv, STM32_ATIM_DMAR_OFFSET));

          _info("  AF1: %04x TISEL: %04x\n",
          stm32pulsecount_getreg(priv, STM32_ATIM_AF1_OFFSET),
          stm32pulsecount_getreg(priv, STM32_ATIM_TISEL_OFFSET));
    }
}
#endif

/****************************************************************************
 * Name: stm32pulsecount_output_configure
 *
 * Description:
 *   Configure pulsecount output for given channel
 *
 * Input Parameters:
 *   priv - A reference to the pulsecount timer status
 *   channel - Timer output channel
 *
 * Returned Value:
 *   Zero on success;
 ****************************************************************************/

static int
stm32pulsecount_output_configure(struct stm32_pulsecounttimer_s *priv,
                                 uint8_t channel)
{
  uint32_t cr2;
  uint32_t ccer;

  /* Get current registers state */

  cr2  = stm32pulsecount_getreg(priv, STM32_GTIM_CR2_OFFSET);
  ccer = stm32pulsecount_getreg(priv, STM32_GTIM_CCER_OFFSET);

  /* Reset the output polarity level of all channels (selects high
   * polarity)
   */

  ccer &= ~(GTIM_CCER_CC1P << ((channel - 1) * 4));

  /* Enable the output state of the selected channels */

  ccer |= (GTIM_CCER_CC1E << ((channel - 1) * 4));

  if (priv->timtype == TIMTYPE_ADVANCED)
    {
      cr2 &= ~(ATIM_CR2_OIS1 << ((channel - 1) * 2));
    }

  stm32pulsecount_modifyreg(priv, STM32_GTIM_CR2_OFFSET, 0, cr2);
  stm32pulsecount_modifyreg(priv, STM32_GTIM_CCER_OFFSET, 0, ccer);

  return OK;
}

/****************************************************************************
 * Name: stm32pulsecount_timer
 *
 * Description:
 *   (Re-)initialize the timer resources and start the pulsed output
 *
 * Input Parameters:
 *   priv - A reference to the lower half pulsecount driver state structure
 *   info - A reference to the characteristics of the pulsed output
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

static int stm32pulsecount_timer(struct stm32_pulsecounttimer_s *priv,
                          const struct pulsecount_info_s *info)
{
  /* Calculated values */

  uint32_t prescaler;
  uint32_t timclk;
  uint32_t reload;
  uint32_t ccr;
  ub16_t duty;
  uint32_t chanmode = GTIM_CCMR_MODE_PWM1;
  uint8_t channel;

  /* Register contents */

  uint32_t cr1;
  uint32_t ccmr1;
#if defined(HAVE_CCMR2)
  uint32_t ccmr2;
  uint32_t ocmode2;
#endif

