apache/nuttx/arch/arm/src/common/stm32/stm32_pulsecount_m0_v1.c
  /* New timer register bit settings */

  uint32_t ocmode1;

  DEBUGASSERT(priv != NULL && info != NULL);

  ccmr1 = stm32pulsecount_getreg(priv, STM32_GTIM_CCMR1_OFFSET);

#if defined(HAVE_CCMR2)
  ccmr2 = stm32pulsecount_getreg(priv, STM32_GTIM_CCMR2_OFFSET);
#endif

  _info("TIM%u channel: %u high: %" PRIu32 " ns low: %" PRIu32
          " ns count: %" PRIu32 "\n",
          priv->timid, priv->channel.channel, info->high_ns,
          info->low_ns, info->count);

  DEBUGASSERT(pulsecount_frequency(info) > 0);

  /* Disable all interrupts and DMA requests, clear all pending status */

  stm32pulsecount_putreg(priv, STM32_GTIM_DIER_OFFSET, 0);
  stm32pulsecount_putreg(priv, STM32_GTIM_SR_OFFSET, 0);

  /* Calculate optimal values for the timer prescaler and for the timer
   * reload register.  If 'frequency' is the desired frequency, then
   *
   *   reload = timclk / frequency
   *   timclk = pclk / presc
   *
   * Or,
   *
   *   reload = pclk / presc / frequency
   *
   * There are many solutions to this, but the best solution will be the
   * one that has the largest reload value and the smallest prescaler value.
   * That is the solution that should give us the most accuracy in the timer
   * control.  Subject to:
   *
   *   0 <= presc  <= 65536
   *   1 <= reload <= 65535
   *
   * So presc = pclk / 65535 / frequency would be optimal.
   *
   * Example:
   *
   *  pclk      = 42 MHz
   *  frequency = 100 Hz
   *
   *  prescaler = 42,000,000 / 65,535 / 100
   *            = 6.4 (or 7 -- taking the ceiling always)
   *  timclk    = 42,000,000 / 7
   *            = 6,000,000
   *  reload    = 6,000,000 / 100
   *            = 60,000
   */

  prescaler = (priv->pclk / pulsecount_frequency(info) + 65534) / 65535;
  if (prescaler < 1)
    {
      prescaler = 1;
    }
  else if (prescaler > 65536)
    {
      prescaler = 65536;
    }

  timclk = priv->pclk / prescaler;

  reload = timclk / pulsecount_frequency(info);

  if (reload < 2)
    {
      reload = 1;
    }
  else if (reload > 65535)
    {
      reload = 65535;
    }
  else
    {
      reload--;
    }

  _info("TIM%u PCLK: %" PRIu32 " frequency: %" PRIu32 " "
          "TIMCLK: %" PRIu32 " prescaler: %" PRIu32
          " reload: %" PRIu32 "\n",
          priv->timid, priv->pclk, pulsecount_frequency(info), timclk,
          prescaler, reload);

  /* Set up the timer CR1 register:
   *
   * 1,8   CKD[1:0] ARPE CMS[1:0] DIR OPM URS UDIS CEN
   * 2-5   CKD[1:0] ARPE CMS      DIR OPM URS UDIS CEN
   * 6-7            ARPE              OPM URS UDIS CEN
   * 9-14  CKD[1:0] ARPE                  URS UDIS CEN
   * 15-17 CKD[1:0] ARPE              OPM URS UDIS CEN
   */

  cr1 = stm32pulsecount_getreg(priv, STM32_GTIM_CR1_OFFSET);

  /* Disable the timer until we get it configured */

  cr1 &= ~GTIM_CR1_CEN;

  cr1 &= ~(GTIM_CR1_DIR | GTIM_CR1_CMS_MASK);

  cr1 |= GTIM_CR1_EDGE;

  /* Set the clock division to zero for all (but the basic timers, but there
   * should be no basic timers in this context
   */

  cr1 &= ~GTIM_CR1_CKD_MASK;
  stm32pulsecount_putreg(priv, STM32_GTIM_CR1_OFFSET, cr1);

  /* Set the reload and prescaler values */

  stm32pulsecount_putreg(priv, STM32_GTIM_ARR_OFFSET, reload);
  stm32pulsecount_putreg(priv, STM32_GTIM_PSC_OFFSET, (prescaler - 1));

  /* Set the advanced timer's repetition counter */

  if (priv->timtype == TIMTYPE_ADVANCED)
    {
      /* If a non-zero repetition count has been selected, then set the
       * repetition counter to the count-1.  stm32pulsecount_start() has
       * already assured us that the count value is within range.
       */

      if (info->count > 0)
        {
          /* Save the remaining count and the number of counts that will have
           * elapsed on the first interrupt.
           */

          /* If the first interrupt occurs at the end end of the first
           * repetition count, then the count will be the same as the RCR
           * value.
           */

          priv->prev  = stm32pulsecount_pulsecount(info->count);
          stm32pulsecount_putreg(priv, STM32_ATIM_RCR_OFFSET,
                                 priv->prev - 1);

          /* Generate an update event to reload the prescaler.  This should
           * preload the RCR into active repetition counter.
           */

          stm32pulsecount_putreg(priv, STM32_ATIM_EGR_OFFSET, ATIM_EGR_UG);

          /* Now set the value of the RCR that will be loaded on the next
           * update event.
           */

          priv->count = info->count;
          priv->curr  = stm32pulsecount_pulsecount(info->count
                                            - priv->prev);
          stm32pulsecount_putreg(priv, STM32_ATIM_RCR_OFFSET,
                                 priv->curr - 1);
        }

      /* Otherwise, just clear the repetition counter */

      else
        {
          /* Set the repetition counter to zero */

          stm32pulsecount_putreg(priv, STM32_ATIM_RCR_OFFSET, 0);

          /* Generate an update event to reload the prescaler */

          stm32pulsecount_putreg(priv, STM32_ATIM_EGR_OFFSET, ATIM_EGR_UG);
        }
    }

  /* Handle channel specific setup */

  ocmode1   = 0;
#if defined(HAVE_CCMR2)
  ocmode2   = 0;
#endif

  duty = pulsecount_duty(info);
  channel = priv->channel.channel;

  /* Duty cycle:
   *
   * duty cycle = ccr / reload (fractional value)
   */

  ccr = b16toi(duty * reload + b16HALF);

  _info("ccr: %" PRIu32 "\n", ccr);

  switch (channel)
    {
      case 1:
        ocmode1  |= (GTIM_CCMR_CCS_CCOUT << GTIM_CCMR1_CC1S_SHIFT) |
                    (chanmode << GTIM_CCMR1_OC1M_SHIFT) |
                    GTIM_CCMR1_OC1PE;
        stm32pulsecount_putreg(priv, STM32_GTIM_CCR1_OFFSET, ccr);
        ccmr1 &= ~(GTIM_CCMR1_CC1S_MASK | GTIM_CCMR1_OC1M_MASK |
                   GTIM_CCMR1_OC1PE | GTIM_CCMR1_OC1M);
        break;

      case 2:
        ocmode1  |= (GTIM_CCMR_CCS_CCOUT << GTIM_CCMR1_CC2S_SHIFT) |
                    (chanmode << GTIM_CCMR1_OC2M_SHIFT) |
                    GTIM_CCMR1_OC2PE;
        stm32pulsecount_putreg(priv, STM32_GTIM_CCR2_OFFSET, ccr);
        ccmr1 &= ~(GTIM_CCMR1_CC2S_MASK | GTIM_CCMR1_OC2M_MASK |
                   GTIM_CCMR1_OC2PE | GTIM_CCMR1_OC2M);
        break;

      case 3:
        ocmode2  |= (ATIM_CCMR_CCS_CCOUT << ATIM_CCMR2_CC3S_SHIFT) |
                    (chanmode << ATIM_CCMR2_OC3M_SHIFT) |
                    ATIM_CCMR2_OC3PE;
        stm32pulsecount_putreg(priv, STM32_ATIM_CCR3_OFFSET, ccr);
        ccmr2 &= ~(ATIM_CCMR2_CC3S_MASK | ATIM_CCMR2_OC3M_MASK |
                   ATIM_CCMR2_OC3PE | ATIM_CCMR2_OC3M);
        break;

      case 4:
        ocmode2  |= (ATIM_CCMR_CCS_CCOUT << ATIM_CCMR2_CC4S_SHIFT) |
                    (chanmode << ATIM_CCMR2_OC4M_SHIFT) |
                    ATIM_CCMR2_OC4PE;
        stm32pulsecount_putreg(priv, STM32_ATIM_CCR4_OFFSET, ccr);
        ccmr2 &= ~(ATIM_CCMR2_CC4S_MASK | ATIM_CCMR2_OC4M_MASK |
                   ATIM_CCMR2_OC4PE | ATIM_CCMR2_OC4M);
        break;

      default:
        _err("ERROR: No such channel: %u\n", channel);
        return -EINVAL;
    }

