apache/nuttx/arch/arm/src/common/stm32/stm32_pulsecount_m0_v1.c
  stm32pulsecount_output_configure(priv, channel);

  ccmr1 |= ocmode1;
#if defined(HAVE_CCMR2)
  ccmr2 |= ocmode2;
#endif

  if (priv->timtype == TIMTYPE_ADVANCED)
    {
      uint32_t bdtr;

      /* Get current register state */

      bdtr  = stm32pulsecount_getreg(priv, STM32_ATIM_BDTR_OFFSET);

      bdtr &= ~(ATIM_BDTR_OSSI | ATIM_BDTR_OSSR);
      bdtr |= ATIM_BDTR_MOE;

      stm32pulsecount_putreg(priv, STM32_ATIM_BDTR_OFFSET, bdtr);
    }

  /* Save the modified register values */

  putreg32(ccmr1, priv->base + STM32_GTIM_CCMR1_OFFSET);
#if defined(HAVE_CCMR2)
  putreg32(ccmr2, priv->base + STM32_ATIM_CCMR2_OFFSET);
#endif

  /* Set the ARR Preload Bit */

  cr1 = stm32pulsecount_getreg(priv, STM32_GTIM_CR1_OFFSET);
  cr1 |= GTIM_CR1_ARPE;
  stm32pulsecount_putreg(priv, STM32_GTIM_CR1_OFFSET, cr1);

  /* Setup update interrupt. If info->count is > 0, then we can
   * be assured that stm32pulsecount_start() has already verified: (1) that
   * this is an advanced timer, and that (2) the repetition count is within
   * range.
   */

  if (info->count > 0)
    {
      /* Clear all pending interrupts and enable the update interrupt. */

      stm32pulsecount_putreg(priv, STM32_GTIM_SR_OFFSET, 0);
      stm32pulsecount_putreg(priv, STM32_GTIM_DIER_OFFSET, GTIM_DIER_UIE);

      /* Enable the timer */

      cr1 |= GTIM_CR1_CEN;
      stm32pulsecount_putreg(priv, STM32_GTIM_CR1_OFFSET, cr1);

      /* And enable timer interrupts at the NVIC */

      up_enable_irq(priv->irq);
    }
  else
    {
      /* Just enable the timer, leaving all interrupts disabled */

      cr1 |= GTIM_CR1_CEN;
      stm32pulsecount_putreg(priv, STM32_GTIM_CR1_OFFSET, cr1);
    }

  stm32pulsecount_dumpregs(priv, "After starting");
  return OK;
}

/****************************************************************************
 * Name: stm32pulsecount_interrupt
 *
 * Description:
 *   Handle timer interrupts.
 *
 * Input Parameters:
 *   priv - A reference to the lower half pulsecount driver state structure
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 ****************************************************************************/

static int stm32pulsecount_interrupt(struct stm32_pulsecounttimer_s *priv)
{
  uint16_t regval;

  /* Verify that this is an update interrupt.  Nothing else is expected. */

  regval = stm32pulsecount_getreg(priv, STM32_ATIM_SR_OFFSET);
  DEBUGASSERT((regval & ATIM_SR_UIF) != 0);

  /* Clear the UIF interrupt bit */

  stm32pulsecount_putreg(priv, STM32_ATIM_SR_OFFSET, regval & ~ATIM_SR_UIF);

  /* Calculate the new count by subtracting the number of pulses
   * since the last interrupt.
   */

  if (priv->count <= priv->prev)
    {
      /* We are finished.  Turn off the mast output to stop the output as
       * quickly as possible.
       */

      regval  = stm32pulsecount_getreg(priv, STM32_ATIM_BDTR_OFFSET);
      regval &= ~ATIM_BDTR_MOE;
      stm32pulsecount_putreg(priv, STM32_ATIM_BDTR_OFFSET, regval);

      /* Disable first interrupts, stop and reset the timer */

      stm32pulsecount_stop((struct pulsecount_lowerhalf_s *)priv);

      /* Then perform the callback into the upper half driver */

      pulsecount_expired(priv->handle);

      priv->handle = NULL;
      priv->count  = 0;
      priv->prev   = 0;
      priv->curr   = 0;
    }
  else
    {
      /* Decrement the count of pulses remaining using the number of
       * pulses generated since the last interrupt.
       */

      priv->count -= priv->prev;

      /* Set up the next RCR.  Set 'prev' to the value of the RCR that
       * was loaded when the update occurred (just before this interrupt)
       * and set 'curr' to the current value of the RCR register (which
       * will bet loaded on the next update event).
       */

      priv->prev = priv->curr;
      priv->curr = stm32pulsecount_pulsecount(priv->count - priv->prev);
      stm32pulsecount_putreg(priv, STM32_ATIM_RCR_OFFSET, priv->curr - 1);
    }

  /* Now all of the time critical stuff is done so we can do some debug
   * output
   */

  _info("Update interrupt SR: %04x prev: %" PRIu32 " curr: %" PRIu32
          " count: %" PRIu32 "\n",
          regval, priv->prev, priv->curr, priv->count);

  return OK;
}

/****************************************************************************
 * Name: stm32pulsecount_tim1interrupt
 *
 * Description:
 *   Handle timer 1 interrupts.
 *
 * Input Parameters:
 *   Standard NuttX interrupt inputs
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

static int stm32pulsecount_tim1interrupt(int irq, void *context, void *arg)
{
  return stm32pulsecount_interrupt(&g_pulsecount1dev);
}

/****************************************************************************
 * Name: stm32pulsecount_pulsecount
 *
 * Description:
 *   Pick an optimal pulse count to program the RCR.
 *
 * Input Parameters:
 *   count - The total count remaining
 *
 * Returned Value:
 *   The recommended pulse count
 *
 ****************************************************************************/

static uint32_t stm32pulsecount_pulsecount(uint32_t count)
{
  /* The the remaining pulse count is less than or equal to the maximum, the
   * just return the count.
   */

  if (count <= ATIM_RCR_REP_MAX)
    {
      return count;
    }

  /* Otherwise, we have to be careful.  We do not want a small number of
   * counts at the end because we might have trouble responding fast enough.
   * If the remaining count is less than 150% of the maximum, then return
   * half of the maximum.  In this case the final sequence will be between 64
   * and 128.
   */

  else if (count < (3 * ATIM_RCR_REP_MAX / 2))
    {
      return (ATIM_RCR_REP_MAX + 1) >> 1;
    }

  /* Otherwise, return the maximum.  The final count will be 64 or more */

  else
    {
      return ATIM_RCR_REP_MAX;
    }
}

/****************************************************************************
 * Name: stm32pulsecount_setapbclock
 *
 * Description:
 *   Enable or disable APB clock for the timer peripheral
 *
 * Input Parameters:
 *   dev - A reference to the lower half pulsecount driver state structure
 *   on  - Enable clock if 'on' is 'true' and disable if 'false'
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

