apache/nuttx/arch/arm/src/common/stm32/stm32_pulsecount_m0_v1.c
static void stm32pulsecount_setapbclock(
  struct stm32_pulsecounttimer_s *priv, bool on)
{
  uint32_t en_bit;
  uint32_t regaddr;

  /* Determine which timer to configure */

  switch (priv->timid)
    {
#ifdef CONFIG_STM32_TIM1_PULSECOUNT
      case 1:
        regaddr  = STM32_RCC_APB2ENR;
        en_bit   = RCC_APB2ENR_TIM1EN;
        break;
#endif
      default:
        return;
    }

  /* Enable/disable APB 1/2 clock for timer */

  if (on)
    {
      modifyreg32(regaddr, 0, en_bit);
    }
  else
    {
      modifyreg32(regaddr, en_bit, 0);
    }
}

/****************************************************************************
 * Name: stm32pulsecount_setup
 *
 * Description:
 *   This method is called when the driver is opened.  The lower half driver
 *   should configure and initialize the device so that it is ready for use.
 *   It should not, however, output pulses until the start method is called.
 *
 * Input Parameters:
 *   dev - A reference to the lower half pulsecount driver state structure
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 * Assumptions:
 *   APB1 or 2 clocking for the GPIOs has already been configured by the RCC
 *   logic at power up.
 *
 ****************************************************************************/

static int stm32pulsecount_setup(struct pulsecount_lowerhalf_s *dev)
{
  struct stm32_pulsecounttimer_s *priv =
    (struct stm32_pulsecounttimer_s *)dev;
  uint32_t pincfg;

  _info("TIM%u\n", priv->timid);
  stm32pulsecount_dumpregs(priv, "Initially");

  /* Enable APB1/2 clocking for timer. */

  stm32pulsecount_setapbclock(priv, true);

  /* Configure the pulsecount output pins, but do not start the timer yet */

  pincfg = priv->channel.pincfg;
  if (pincfg != 0)
    {
      _info("pincfg: %08" PRIx32 "\n", pincfg);

      stm32_configgpio(pincfg);
    }

  pulsecount_dumpgpio(pincfg, "pulsecount setup");

  return OK;
}

/****************************************************************************
 * Name: stm32pulsecount_shutdown
 *
 * Description:
 *   This method is called when the driver is closed.  The lower half driver
 *   stop pulsed output, free any resources, disable the timer hardware, and
 *   put the system into the lowest possible power usage state
 *
 * Input Parameters:
 *   dev - A reference to the lower half pulsecount driver state structure
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

static int stm32pulsecount_shutdown(struct pulsecount_lowerhalf_s *dev)
{
  struct stm32_pulsecounttimer_s *priv =
    (struct stm32_pulsecounttimer_s *)dev;
  uint32_t pincfg;

  _info("TIM%u\n", priv->timid);

  /* Make sure that the output has been stopped */

  stm32pulsecount_stop(dev);

  /* Disable APB1/2 clocking for timer. */

  stm32pulsecount_setapbclock(priv, false);

  /* Then put the GPIO pins back to the default state */

  pincfg = priv->channel.pincfg;
  if (pincfg != 0)
    {
      _info("pincfg: %08" PRIx32 "\n", pincfg);

      pincfg &= (GPIO_PORT_MASK | GPIO_PIN_MASK);
      pincfg |= GPIO_INPUT | GPIO_FLOAT;

      stm32_configgpio(pincfg);
    }

  return OK;
}

/****************************************************************************
 * Name: stm32pulsecount_start
 *
 * Description:
 *   (Re-)initialize the timer resources and start the pulsed output
 *
 * Input Parameters:
 *   dev - A reference to the lower half pulsecount driver state structure
 *   info - A reference to the characteristics of the pulsed output
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

static int stm32pulsecount_start(struct pulsecount_lowerhalf_s *dev,
                                 const struct pulsecount_info_s *info,
                                 void *handle)
{
  struct stm32_pulsecounttimer_s *priv =
    (struct stm32_pulsecounttimer_s *)dev;

  /* Check if a pulsecount has been selected */

  if (info->count > 0)
    {
      /* Only the advanced timers (TIM1,8 can support the pulse counting) */

      if (priv->timtype != TIMTYPE_ADVANCED)
        {
          _err("ERROR: TIM%u cannot support pulse count: %" PRIu32 "\n",
                 priv->timid, info->count);
          return -EPERM;
        }
    }

  /* Save the handle */

  priv->handle = handle;

  /* Start the time */

  return stm32pulsecount_timer(priv, info);
}

/****************************************************************************
 * Name: stm32pulsecount_stop
 *
 * Description:
 *   Stop the pulsed output and reset the timer resources
 *
 * Input Parameters:
 *   dev - A reference to the lower half pulsecount driver state structure
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 * Assumptions:
 *   This function is called to stop the pulsed output at anytime.  This
 *   method is also called from the timer interrupt handler when a repetition
 *   count expires... automatically stopping the timer.
 *
 ****************************************************************************/

static int stm32pulsecount_stop(struct pulsecount_lowerhalf_s *dev)
{
  struct stm32_pulsecounttimer_s *priv =
    (struct stm32_pulsecounttimer_s *)dev;
  uint32_t resetbit;
  uint32_t regaddr;
  uint32_t regval;
  irqstate_t flags;

  _info("TIM%u\n", priv->timid);

  /* Disable interrupts momentary to stop any ongoing timer processing and
   * to prevent any concurrent access to the reset register.
   */

  flags = enter_critical_section();

  /* Disable further interrupts and stop the timer */

  stm32pulsecount_putreg(priv, STM32_GTIM_DIER_OFFSET, 0);
  stm32pulsecount_putreg(priv, STM32_GTIM_SR_OFFSET, 0);

  /* Determine which timer to reset */

  switch (priv->timid)
    {
#ifdef CONFIG_STM32_TIM1_PULSECOUNT
      case 1:
        regaddr  = STM32_RCC_APB2RSTR;
        resetbit = RCC_APB2RSTR_TIM1RST;
        break;
#endif

      default:
        leave_critical_section(flags);
        return -EINVAL;
    }

  /* Reset the timer - stopping the output and putting the timer back
   * into a state where stm32pulsecount_start() can be called.
   */

  regval  = getreg32(regaddr);
  regval |= resetbit;
  putreg32(regval, regaddr);

  regval &= ~resetbit;
  putreg32(regval, regaddr);
  leave_critical_section(flags);

  _info("regaddr: %08" PRIx32 " resetbit: %08" PRIx32 "\n",
          regaddr, resetbit);
  stm32pulsecount_dumpregs(priv, "After stop");
  return OK;
}

/****************************************************************************
 * Name: stm32pulsecount_ioctl
 *
 * Description:
 *   Lower-half logic may support platform-specific ioctl commands
 *
 * Input Parameters:
 *   dev - A reference to the lower half pulsecount driver state structure
 *   cmd - The ioctl command
 *   arg - The argument accompanying the ioctl command
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

static int stm32pulsecount_ioctl(struct pulsecount_lowerhalf_s *dev, int cmd,
                                 unsigned long arg)
{
#ifdef CONFIG_DEBUG_TIMER_INFO
  struct stm32_pulsecounttimer_s *priv =
    (struct stm32_pulsecounttimer_s *)dev;

  /* There are no platform-specific ioctl commands */

  _info("TIM%u\n", priv->timid);
#endif
  return -ENOTTY;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_pulsecountinitialize
 *
 * Description:
 *   Initialize one timer for use with the upper-level pulsecount driver.
 *
 * Input Parameters:
 *   timer - A number identifying the timer use.  The number of valid timer
 *     IDs varies with the STM32 MCU and MCU family.  This pulsecount driver
 *     supports TIM1 only on STM32F0/L0/G0.
 *
 * Returned Value:
 *   On success, a pointer to the STM32 lower half pulsecount driver is
 *   returned.  NULL is returned on any failure.
 *
 ****************************************************************************/

struct pulsecount_lowerhalf_s *stm32_pulsecountinitialize(int timer)
{
  struct stm32_pulsecounttimer_s *lower;

  _info("TIM%u\n", timer);

  switch (timer)
    {
#ifdef CONFIG_STM32_TIM1_PULSECOUNT
      case 1:
        lower = &g_pulsecount1dev;

        /* Attach but disable the TIM1 update interrupt */

        irq_attach(lower->irq, stm32pulsecount_tim1interrupt, NULL);
        up_disable_irq(lower->irq);
        break;
#endif

      default:
        _err("ERROR: No such timer configured\n");
        return NULL;
    }

  return (struct pulsecount_lowerhalf_s *)lower;
}

#endif /* CONFIG_STM32_TIMx_PULSECOUNT */
